/*
 * arch/arm/mach-msm/board-desirec-camsensor.c - s5k3e2f sensor driver
 *
 *  Copyright (C) 2008 becker hsieh <becker0213@gmail.com>
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; version 2 of the License.
 */

#include <linux/interrupt.h>
#include <linux/i2c.h>
#include <linux/slab.h>
#include <linux/irq.h>
#include <linux/miscdevice.h>
#include <linux/delay.h>
#include <linux/input.h>
#include <linux/workqueue.h>
#include <linux/freezer.h>
#include <linux/netlink.h>
#include <linux/skbuff.h>
#include <linux/clk.h>
#include <net/sock.h>
#include <linux/gpio.h>
#include <linux/uaccess.h>
#include <linux/io.h>
#include <asm/mach-types.h>
#include <mach/msm_iomap.h>
#include <mach/s5k3e2fx.h>
#include "board-desirec.h"
#include "board-desirec-camsensor.h"

typedef struct {
  uint8_t pre_pll_clk_div;               /* 0x0305*/
  uint8_t pll_multiplier_msb;            /* 0x0306*/
  uint8_t pll_multiplier_lsb;            /* 0x0307*/
  uint8_t vt_pix_clk_div;                /* 0x0301*/
  uint8_t vt_sys_clk_div;                /* 0x0303*/
  uint8_t op_pix_clk_div;                /* 0x0309*/
  uint8_t op_sys_clk_div;                /* 0x030B*/
  uint8_t ccp_data_format_msb;           /* 0x0112*/
  uint8_t ccp_data_format_lsb;           /* 0x0113*/
  uint8_t x_output_size_msb;             /* 0x034C*/
  uint8_t x_output_size_lsb;             /* 0x034D*/
  uint8_t y_output_size_msb;             /* 0x034E*/
  uint8_t y_output_size_lsb;             /* 0x034F*/
  uint8_t x_even_inc;                    /* 0x0381*/
  uint8_t x_odd_inc;                     /* 0x0383 */
  uint8_t y_even_inc;                    /* 0x0385 */
  uint8_t y_odd_inc;                     /* 0x0387 */
  uint8_t binning_enable;                /* 0x3014*/
  uint8_t frame_length_lines_msb;        /* 0x0340*/
  uint8_t frame_length_lines_lsb;        /* 0x0341*/
  uint8_t line_length_pck_msb;           /* 0x0342*/
  uint8_t line_length_pck_lsb;           /* 0x0343*/
  uint8_t shade_clk_enable ;             /* 0x30AC*/
  uint8_t sel_ccp;                       /* 0x30C4*/
  uint8_t vpix;                          /* 0x3024*/
  uint8_t clamp_on;                      /* 0x3015*/
  uint8_t offset;                        /* 0x307E*/
  uint8_t ld_start;                      /* 0x3000*/
  uint8_t ld_end;                        /* 0x3001*/
  uint8_t sl_start;                      /* 0x3002*/
  uint8_t sl_end;                        /* 0x3003*/
  uint8_t rx_start;                      /* 0x3004*/
  uint8_t s1_start;                      /* 0x3005*/
  uint8_t s1_end;                        /* 0x3006*/
  uint8_t s1s_start;                     /* 0x3007*/
  uint8_t s1s_end;                       /* 0x3008*/
  uint8_t s3_start;                      /* 0x3009*/
  uint8_t s3_end;                        /* 0x300A*/
  uint8_t cmp_en_start;                  /* 0x300B*/
  uint8_t clp_sl_start;                  /* 0x300C*/
  uint8_t clp_sl_end;                    /* 0x300D*/
  uint8_t off_start;                     /* 0x300E*/
  uint8_t rmp_en_start;                  /* 0x300F*/
  uint8_t tx_start;                      /* 0x3010*/
  uint8_t tx_end;                        /* 0x3011*/
  uint8_t stx_width;                     /* 0x3012*/
  uint8_t reg_3152_reserved;             /* 0x3152*/
  uint8_t reg_315A_reserved;             /* 0x315A*/
  uint8_t analogue_gain_code_global_msb; /* 0x0204*/
  uint8_t analogue_gain_code_global_lsb; /* 0x0205*/
  uint8_t fine_integration_time;         /* 0x0200*/
  uint8_t coarse_integration_time;       /* 0x0202*/
} reg_struct;


/***********************************************************
* global variable
************************************************************/
static uint16_t chipid;
static struct i2c_client *pclient_i2c;
static struct clk *vfe_clk;
/* camif clocks */
static struct clk *vfe_mdc_clk;
static struct clk *mdc_clk;
static int mdc_clk_enabled;
static int vfe_mdc_clk_enabled;
static int vfe_clk_enabled;
static int powered;
static const uint32_t fps_divider = 1;

static reg_struct s5k3e2fx_reg_pattern[2] =
{
  {
    0x06,  /* pre_pll_clk_div               REG=0x0305*/
    0x00,  /* pll_multiplier_msb            REG=0x0306*/
    0xA4,  /* pll_multiplier_lsb            REG=0x0307 0x88*/
    0x0a,  /* vt_pix_clk_div                REG=0x0301*/
    0x01,  /* vt_sys_clk_div                REG=0x0303*/
    0x0a,  /* op_pix_clk_div                REG=0x0309*/
    0x01,  /* op_sys_clk_div                REG=0x030B*/
